xodio/xod/packages/arduino-cli/test/fixtures/packages/fictional/hardware/fake/1.2.3/boards.txt
#### A FICTIONAL BOARDS.TXT FILE
####
#### ONLY FOR TESTS!

menu.UploadSpeed=Uplo@d Speed (Скорость загрузки)
menu.CpuFrequency=CPU Frequency 123,-_[]():@we$ome

##############################################################
generic.name=Generic Fictional Board
generic.build.board=ESP8266_GENERIC
generic.upload.tool=esptool
generic.upload.maximum_data_size=81920
generic.upload.wait_for_upload_port=true
generic.upload.erase_cmd=
generic.serial.disableDTR=true
generic.serial.disableRTS=true
generic.build.mcu=esp8266
generic.build.core=esp8266
generic.build.variant=generic
generic.build.spiffs_pagesize=256
generic.build.debug_port=
generic.build.debug_level=
generic.menu.CpuFrequency.80=80 MHz (!@#$$%^&*()[]_-+,./)
generic.menu.CpuFrequency.80.build.f_cpu=80000000L
generic.menu.CpuFrequency.160=160 MHz
generic.menu.CpuFrequency.160.build.f_cpu=160000000L
generic.menu.UploadSpeed.115200=115200
generic.menu.UploadSpeed.115200.upload.speed=115200
generic.menu.UploadSpeed.9600=9600
generic.menu.UploadSpeed.9600.upload.speed=9600
generic.menu.UploadSpeed.57600=57600
generic.menu.UploadSpeed.57600.upload.speed=57600
generic.menu.UploadSpeed.230400.linux=230400
generic.menu.UploadSpeed.230400.macosx=230400
generic.menu.UploadSpeed.230400.upload.speed=230400
generic.menu.UploadSpeed.256000.windows=256000
generic.menu.UploadSpeed.256000.upload.speed=256000
generic.menu.UploadSpeed.460800.linux=460800
generic.menu.UploadSpeed.460800.macosx=460800
generic.menu.UploadSpeed.460800.upload.speed=460800
generic.menu.UploadSpeed.512000.windows=512000
generic.menu.UploadSpeed.512000.upload.speed=512000
generic.menu.UploadSpeed.921600=921600
generic.menu.UploadSpeed.921600.upload.speed=921600

##############################################################
another_one.name=Another Fictional Board
another_one.build.board=AMPERKA_WIFI_SLOT
another_one.build.variant=wifi_slot
another_one.upload.tool=esptool
another_one.upload.maximum_data_size=81920
another_one.upload.wait_for_upload_port=true
another_one.upload.erase_cmd=
another_one.serial.disableDTR=true
another_one.serial.disableRTS=true
another_one.build.mcu=esp8266
another_one.build.core=esp8266
another_one.build.spiffs_pagesize=256
another_one.build.debug_port=
another_one.build.debug_level=
another_one.menu.CpuFrequency.80=80 MHz (!@#$$%^&*()[]_-+,./)
another_one.menu.CpuFrequency.80.build.f_cpu=80000000L
another_one.menu.CpuFrequency.160=160 MHz
another_one.menu.CpuFrequency.160.build.f_cpu=160000000L
another_one.menu.UploadSpeed.115200=115200
another_one.menu.UploadSpeed.115200.upload.speed=115200
another_one.menu.UploadSpeed.9600=9600
another_one.menu.UploadSpeed.9600.upload.speed=9600
another_one.menu.UploadSpeed.57600=57600
another_one.menu.UploadSpeed.57600.upload.speed=57600
another_one.menu.UploadSpeed.230400.linux=230400
another_one.menu.UploadSpeed.230400.macosx=230400
another_one.menu.UploadSpeed.230400.upload.speed=230400
another_one.menu.UploadSpeed.256000.windows=256000
another_one.menu.UploadSpeed.256000.upload.speed=256000
another_one.menu.UploadSpeed.460800.linux=460800
another_one.menu.UploadSpeed.460800.macosx=460800
another_one.menu.UploadSpeed.460800.upload.speed=460800
another_one.menu.UploadSpeed.512000.windows=512000
another_one.menu.UploadSpeed.512000.upload.speed=512000
another_one.menu.UploadSpeed.921600=921600
another_one.menu.UploadSpeed.921600.upload.speed=921600
